In [2]:
import pandas as pd

In [3]:
import os
current_directory = os.getcwd()
print(current_directory)

C:\Users\Lyle\Desktop\Data Science Projects\Data Science Salaries

In [4]:
df = pd.read_csv('ds_salaries.csv')

In [5]:
df.head()

,Unnamed: 0,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L

In [6]:
df.columns

Index(['Unnamed: 0', 'work_year', 'experience_level', 'employment_type',
       'job_title', 'salary', 'salary_currency', 'salary_in_usd',
       'employee_residence', 'remote_ratio', 'company_location',
       'company_size'],
      dtype='object')

# Data Cleaning

In [10]:
df.drop(columns=['Unnamed: 0', 'salary', 'salary_currency'])

,work_year,experience_level,employment_type,job_title,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2020,MI,FT,Data Scientist,79833,DE,0,DE,L
1,2020,SE,FT,Machine Learning Scientist,260000,JP,0,JP,S
2,2020,SE,FT,Big Data Engineer,109024,GB,50,GB,M
3,2020,MI,FT,Product Data Analyst,20000,HN,0,HN,S
4,2020,SE,FT,Machine Learning Engineer,150000,US,50,US,L
...,...,...,...,...,...,...,...,...,...
602,2022,SE,FT,Data Engineer,154000,US,100,US,M
603,2022,SE,FT,Data Engineer,126000,US,100,US,M
604,2022,SE,FT,Data Analyst,129000,US,0,US,M
605,2022,SE,FT,Data Analyst,150000,US,100,US,M
606,2022,MI,FT,AI Scientist,200000,IN,100,US,L

In [17]:
df.employee_residence.unique()

array(['DE', 'JP', 'GB', 'HN', 'US', 'HU', 'NZ', 'FR', 'IN', 'PK', 'PL',
       'PT', 'CN', 'GR', 'AE', 'NL', 'MX', 'CA', 'AT', 'NG', 'PH', 'ES',
       'DK', 'RU', 'IT', 'HR', 'BG', 'SG', 'BR', 'IQ', 'VN', 'BE', 'UA',
       'MT', 'CL', 'RO', 'IR', 'CO', 'MD', 'KE', 'SI', 'HK', 'TR', 'RS',
       'PR', 'LU', 'JE', 'CZ', 'AR', 'DZ', 'TN', 'MY', 'EE', 'AU', 'BO',
       'IE', 'CH'], dtype=object)

In [21]:
df.salary_in_usd.mean()

112297.86985172982

In [15]:
df.employment_type.unique()

array(['FT', 'CT', 'PT', 'FL'], dtype=object)

# Questions to ask

## Averages 

1. Average trend in salaries per year
2. Average relationship between experience level and salaries
3. Average relationship between employment type and salaries
4. Average salaries for each job title
5. Average salaries for each employee residence.
6. Average salaries for PH employees
7. Relationship between remote ratio and salaries
8. Average salaries for each company location
9. Average relationship between company size and salaries

## Optimizing salaries

1. Find out optimal parameters for current year's entry-level ds salaries by figuring out the appropriate

1.1. employment type
1.2. job title
1.3. remote ratio
1.4. company location
1.5. company size 

for PH based employees. 

2. Figure out salary increase by increasing experience level.

Goal: Produce an approximate salary output by calibrating the input parameters. 

## Availability metrics

1. experience level counts
2. employment type counts
3. job title counts
4. distribution of salaries
5. employee residence counts
6. remote ratio counts
7. company location counts
8. company size counts